# Chapter 7 Data Cleaning and Preparation

## 7.1 Handling Missing Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

### Filtering Out Missing Data

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
....: [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data.dropna(how = 'all') # only drop rows with all elements na

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(how = 'all', axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# Drop rows/columns with certain number of NAs: thresh
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.741270       NaN       NaN
1 -0.293309       NaN       NaN
2  0.208378       NaN  0.214080
3 -0.193760       NaN -0.792267
4  0.247010  0.997616 -0.985328
5  0.675412  1.282971  0.676904
6 -2.306086  2.640892 -0.501178

In [21]:
df.dropna(thresh = 2) # Cannnot be used for column??

          0         1         2
2  0.208378       NaN  0.214080
3 -0.193760       NaN -0.792267
4  0.247010  0.997616 -0.985328
5  0.675412  1.282971  0.676904
6 -2.306086  2.640892 -0.501178

### Filling in Missing Data

In [22]:
# fill with 0
df.fillna(0)

          0         1         2
0 -0.741270  0.000000  0.000000
1 -0.293309  0.000000  0.000000
2  0.208378  0.000000  0.214080
3 -0.193760  0.000000 -0.792267
4  0.247010  0.997616 -0.985328
5  0.675412  1.282971  0.676904
6 -2.306086  2.640892 -0.501178

In [23]:
# different fill values for different columns
df.fillna({1:0.5, 2:0.44})

          0         1         2
0 -0.741270  0.500000  0.440000
1 -0.293309  0.500000  0.440000
2  0.208378  0.500000  0.214080
3 -0.193760  0.500000 -0.792267
4  0.247010  0.997616 -0.985328
5  0.675412  1.282971  0.676904
6 -2.306086  2.640892 -0.501178

In [26]:
# Modify the existing object instead of creating a new one
_ = df.fillna(0, inplace = True)
df

          0         1         2
0 -0.741270  0.000000  0.000000
1 -0.293309  0.000000  0.000000
2  0.208378  0.000000  0.214080
3 -0.193760  0.000000 -0.792267
4  0.247010  0.997616 -0.985328
5  0.675412  1.282971  0.676904
6 -2.306086  2.640892 -0.501178

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.180285  1.097527 -1.426614
1 -0.127191 -0.913534  0.010273
2  0.556050       NaN -1.520505
3 -0.079375       NaN  0.112948
4 -1.399208       NaN       NaN
5  0.942454       NaN       NaN

In [29]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.180285  1.097527 -1.426614
1 -0.127191 -0.913534  0.010273
2  0.556050 -0.913534 -1.520505
3 -0.079375 -0.913534  0.112948
4 -1.399208 -0.913534  0.112948
5  0.942454 -0.913534  0.112948

In [30]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.180285  1.097527 -1.426614
1 -0.127191 -0.913534  0.010273
2  0.556050 -0.913534 -1.520505
3 -0.079375 -0.913534  0.112948
4 -1.399208       NaN  0.112948
5  0.942454       NaN  0.112948

In [31]:
df.fillna(df.mean()) # fill using the column mean

          0         1         2
0 -0.180285  1.097527 -1.426614
1 -0.127191 -0.913534  0.010273
2  0.556050  0.091996 -1.520505
3 -0.079375  0.091996  0.112948
4 -1.399208  0.091996 -0.705975
5  0.942454  0.091996 -0.705975